import React from "react";
import { useTheme } from "styled-components";
import Svg from "../Svg";
import { SvgProps } from "../types";

const Icon: React.FC<SvgProps> = (props) => {
  const theme = useTheme();
  const primaryColor = theme.isDark ? "#3C3742" : "#e9eaeb";
  const secondaryColor = theme.isDark ? "#666171" : "#bdc2c4";
  return (
    // <Svg viewBox="0 0 32 32" {...props}>
    //   <path d="M32 16c0 8.837-7.163 16-16 16S0 24.837 0 16 7.163 0 16 0s16 7.163 16 16z" fill={primaryColor} />
    //   <mask id="A" mask-type="alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="32" height="32">
    //     <path d="M32 16c0 8.837-7.163 16-16 16S0 24.837 0 16 7.163 0 16 0s16 7.163 16 16z" fill="#c4c4c4" />
    //   </mask>
    //   <g mask="url(#A)">
    //     <path
    //       d="M25.128 16.436c0 3.115-4.133 5.641-9.231 5.641s-9.231-2.526-9.231-5.641V15h18.461v1.436zm2.205 13.806c0-3.815-5.074-6.908-11.333-6.908S4.667 26.426 4.667 30.242V32h22.667v-1.759z"
    //       fill={secondaryColor}
    //     />
    //     <path
    //       fillRule="evenodd"
    //       d="M10.234 5.601C9.942 4.264 10.96 3 12.328 3c1.184 0 2.143.959 2.143 2.143v3.873l1.427-.067c.589 0 1.166.034 1.724.098V5.143c0-1.184.959-2.143 2.143-2.143 1.368 0 2.386 1.264 2.093 2.601l-.931 4.258c2.529 1.006 4.201 2.749 4.201 4.731 0 3.115-4.133 5.641-9.231 5.641s-9.231-2.526-9.231-5.641c0-2.053 1.794-3.849 4.476-4.836l-.908-4.153z"
    //       fill={secondaryColor}
    //     />
    //     <ellipse cx="12.308" cy="14.846" rx="1.026" ry="1.538" fill={primaryColor} />
    //     <ellipse cx="19.385" cy="14.846" rx="1.026" ry="1.538" fill={primaryColor} />
    //   </g>
    // </Svg>
    <Svg viewBox="0 0 32 32" {...props}>
      <g transform="translate(-1784 -16)">
        <path className="cls-1" fill="#555" d="M16,0A16,16,0,1,1,0,16,16,16,0,0,1,16,0Z" transform="translate(1784 16)" />
        <g id="组_4689" data-name="组 4689" transform="translate(1673.463 -1323.635)">
          <path id="减去_2" data-name="减去 2" className="cls-2" fill="#b8b8b8" fill-rule="evenodd" d="M2.148,19.169A9.594,9.594,0,0,1,.643,9.629c1.1-2.974,4.5-5.389,6.112-6.509a12.562,12.562,0,0,1,1.077-.892L8.357,0,9.936,1.872l6.927,1.07,1.753-1.694L19.931,4.28s3.8,3.054,2.943,11.616C22.45,21.58,9.331,26.818,2.148,19.169Z" transform="translate(115.037 1344.135)" />
          <path id="形状_34" data-name="形状 34" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M262.974,294.293l-.454-.181s1.142-1.7,2-1.9a3.277,3.277,0,0,1,3.725,1.268c.143.23-.067.33-.272.725a2.605,2.605,0,0,1-2.453,1.449A4.057,4.057,0,0,1,262.974,294.293Z" transform="translate(-137.312 1059.534)" />
          <path id="形状_38_拷贝" data-name="形状 38 拷贝" className="cls-4" fill="#110f06" fill-rule="evenodd" d="M352.215,215.621s-.018.921-.04,1.018.448-.409.619-.38c-.035.018.127.127-.19.332-.306.362-.4.211-.479.388s0,.231-.045.276c-.167.185-.2-.025-.19-.427A4.93,4.93,0,0,1,352.215,215.621Z" transform="translate(-220.302 1132.656)" />
          <path id="形状_38_拷贝-2" data-name="形状 38 拷贝" className="cls-4" fill="#110f06" fill-rule="evenodd" d="M352.256,215.621s.011.573.025.634-.279-.255-.385-.236c.022.011-.079.079.119.207.19.226.248.132.3.242s0,.144.028.172c.1.115.122-.016.119-.266A3.069,3.069,0,0,0,352.256,215.621Z" transform="translate(-229.36 1131.544)" />
          <path id="形状_38" data-name="形状 38" className="cls-5" fill="#110f06" fill-rule="evenodd" d="M229.793,234.491s.96,1.124.906,1.355,1.066-.974,1.473-.9c.014.374-.883,1.5-1.02,1.807a1.169,1.169,0,0,1-.562.647c-.241-.163-.406-.24-.571-1.1a14.816,14.816,0,0,1-.227-1.807Z" transform="translate(-106.209 1113.696)" />
          <path id="形状_39_拷贝" data-name="形状 39 拷贝" className="cls-6" fill="#fefefe" fill-rule="evenodd" d="M265.32,265.684s-2.171-1.04-3.089.543a1.493,1.493,0,0,0,.182,2.083c.178.128-.585-1.748,1.452-1.648.891.044.789.338,1.092.471S266.115,266.8,265.32,265.684Z" transform="translate(-136.837 1084.608)" />
          <path id="形状_39" data-name="形状 39" className="cls-6" fill="#fefefe" fill-rule="evenodd" d="M179.962,254.8s1.832-1.219,2.18.181a5.467,5.467,0,0,1-.272,3.26c-.163.121.363-1.924-.454-2.264s-.789-.222-1.09-.091S178.8,255.9,179.962,254.8Z" transform="translate(-59.009 1095.508)" />
          <path id="形状_41" data-name="形状 41" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M161.623,384.45a2.827,2.827,0,0,1,0,.634c-.047.11.1.612-1,.181a1.432,1.432,0,0,1-.636-.543s-.611-.512,0,.362a2.958,2.958,0,0,0,2.18,1.087,9.324,9.324,0,0,0,3.18.181,3.9,3.9,0,0,0,1.453-1,4.359,4.359,0,0,1-1.635.724,5.156,5.156,0,0,1-2.816-.453c-.456-.187-.558-.4-.545-.543.006-.068,0-.274,0-.453C161.807,384.3,161.682,384.166,161.623,384.45Z" transform="translate(-40.06 975.195)" />
          <path id="椭圆_14" data-name="椭圆 14" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M159.949,278.189c1.058,0,2.14,1.041,1.917,1.862a2.7,2.7,0,0,1-1.917,1.862c-1.054.093-1.523-1.094-1.59-1.862A1.689,1.689,0,0,1,159.949,278.189Z" transform="translate(-39.358 1073.407)" />
          <circle id="椭圆_16" data-name="椭圆 16" className="cls-7" fill="#fefefe" cx="0.318" cy="0.318" r="0.318" transform="translate(121.057 1352.762)" />
          <circle id="椭圆_17" data-name="椭圆 17" className="cls-8" fill="#110f06" cx="0.182" cy="0.182" r="0.182" transform="translate(124.415 1358.695)" />
          <path id="椭圆_18" data-name="椭圆 18" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M166.733,340.858c1.962.067,1.953.73,1.953,1.63a1.985,1.985,0,0,1-3.906,0C164.78,341.588,164.975,340.8,166.733,340.858Z" transform="translate(-45.007 1015.553)" />
          <path id="形状_35" data-name="形状 35" className="cls-9" d="M276.758,300.909l.545.091s.586.152,0,.543a3.876,3.876,0,0,1-.636,0s-.52.143.091,1c.335.406.272.453.272.453s-.858.234-1.817-1.177c.677-.776.649-.842,1.272-1.177C276.8,300.454,276.889,300.605,276.758,300.909Z" transform="translate(-148.677 1051.731)" />
          <path id="形状_33" data-name="形状 33" className="cls-9" fill="#fefefe" fill-rule="evenodd" d="M159.871,286.4s-1.515,2.289,1.09,2.445c-1.12.905-1.929.409-2.18,0a3.933,3.933,0,0,1-.363-1.177l-.182-.091s-.094-.332.182-.181C158.72,287.558,158.618,286.284,159.871,286.4Z" transform="translate(-39.132 1065.715)" />
          <path id="形状_36" data-name="形状 36" className="cls-9" fill="#fefefe" fill-rule="evenodd" d="M175.442,360.1s.348.2.363.272a.585.585,0,0,0-.273-.543c-.326-.229-.414-.212-.454-.181S174.77,360.2,175.442,360.1Z" transform="translate(-54.612 998.054)" />
          <path id="形状_37" data-name="形状 37" className="cls-9" d="M193.644,365.638l.273.091s-.134-.739-.636-.272-.091.272-.091.272Z" transform="translate(-71.28 992.411)" />
          <path id="椭圆_17_拷贝_2" data-name="椭圆 17 拷贝 2" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M241.082,387.716c.075,0,.136.081.136.181s-.061.181-.136.181-.136-.081-.136-.181S241.007,387.716,241.082,387.716Z" transform="translate(-116.318 971.964)" />
          <circle id="椭圆_17_拷贝_3" data-name="椭圆 17 拷贝 3" className="cls-8" fill="#110f06" cx="0.155" cy="0.155" r="0.155" transform="translate(119.213 1357.553)" />
          <path id="椭圆_17_拷贝_4" data-name="椭圆 17 拷贝 4" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M153.9,360.256a.154.154,0,1,1-.154.154A.154.154,0,0,1,153.9,360.256Z" transform="translate(-34.606 997.793)" />
          <path id="椭圆_17_拷贝_5" data-name="椭圆 17 拷贝 5" className="cls-3" fill="#110f06" fill-rule="evenodd" d="M157.312,368.8a.086.086,0,1,1-.061.025A.086.086,0,0,1,157.312,368.8Z" transform="translate(-37.725 989.743)" />
          <circle id="椭圆_17_拷贝" data-name="椭圆 17 拷贝" className="cls-8" fill="#110f06" cx="0.121" cy="0.121" r="0.121" transform="translate(123.663 1359.46)" />
        </g>
      </g>
    </Svg>

  );
};

export default Icon;
